# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
# стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
# двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
# с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.
a, b, c = 7, 7, 7
if a + b > c and a + c > b and b + c > a:
    print('Задан правильный треугольник', end=" ")
    if a == b and b == c:
        print("и он является равносторонним.")
    elif a == b or b == c or c == a:
        print("и он является равнобедренным.")
    else:
        print("и он является разносторонним.")
else:
    print("Треугольника с такими сторонами не существует.")
